10_rails/_crud/restaurant_reviews_exo/restaurant_reviews_correction/app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.restaurant = @restaurant
    if @review.save
---
INSERT INTO "reviews" ("content", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "c'était super !"], ["restaurant_id", 4], ["created_at", "2021-11-10 09:28:07.390657"], ["updated_at", "2021-11-10 09:28:07.390657"]]

  def destroy
    @review = Review.find(params[:id])
    @restaurant = @review.restaurant
    @review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]

  def set_restaurant
    @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]